<? include "header.php"?>
<nav>
    <ul class = "ul">
        <li>Меню 1</il>
        <li>Меню 2</il>
        <li>Меню 3</il>
        <li>Меню 4</il>
        <li>Меню 5</il>
    </ul>
</nav>
<body>
    <h1>Блочная модель документа</h1>
    <p></p>
    <div class = "block">Содержание блока</div>
        <div class = "block">Содержание блока еще одно</div>
        <h2>прочитать про схлопывание марджинов!</h2>
    <h1>Рамки</h1>
    <div class = "block1">Содержание блока</div>
        <p>Рамку можно указать с любой из сторон.</p>
    <h1>Отступы - Padding</h1>
    <div class = "position_fixed">Содержание блока</div>
    <!--<div class = "position_ralative">Содержание блока</div>-->
    <div class = "position_absolute">Содержание блока</div>
    <h1>Плавающие элементы</h1>
    <div class = "float">Содержание блока</div>
    <div class = "float">Содержание блока</div>
    <p>Текст рыба Текст рыбаТекст рыбаТекст рыбаТекст рыбаТекст рыбаТекст рыба</p>
    <h1>Верстка сеткой</h1>
    <p>Дома: 2 горизонтальное меню с выпадающим списком<br> 3 сверстать модальное окно регистрации или авторизации<br>1 одну страницу сверстать на сетке</p>
    
    
</body>
<? include "footer.php"?>